#include <ultra64.h>
#include "common.h"


s32 func_80070270_158330(s32 arg0) {
	func_8007290C_15A9CC();
	return 0;
}

#ifdef NON_MATCHING
/* CURRENT(4058) */
void func_80070294_158354(Unk8007CAA8_6A40 *arg0) {
	s32 center;
	s32 halfWidth;

	if (D_800E65D0 == 0) {
		return;
	}

	if ((isButtonNewlyPressed(0, 0x8000) == 0) && (D_800E65C8->unk0 != 4)) {
		return;
	}

	center = D_800E65C8->unk28 + D_800E65CC;
	halfWidth = D_800E65C8->unk2A;
	if (halfWidth < 0) {
		halfWidth = (halfWidth + 1) >> 1;
	} else {
		halfWidth >>= 1;
	}

	if (func_8007C3C0_164480(D_800E6A78.unk4C - 96.0f,
							 D_800E6A78.unk54 - 96.0f,
							 (f32)(center - halfWidth),
							 (f32)(center + halfWidth),
							 0.0f,
							 30.0f) != 0) {
		if (func_8007A370_162430(0, (s32)(((f64)(f32)(D_800E6A86 & 0xFFFF) * D_800A4A00_18CAC0) / 32768.0)) != 0) {
			D_800E65A8 |= 0x800;
		}
	}
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_80070294_158354.s")
#endif

s32 func_800703D0_158490(void) {
	return D_800E65C8->unk28 + D_800E65CC;
}

u8 func_800703EC_1584AC(void) {
	return D_800E65C8->unk0;
}

void func_800703FC_1584BC(s32 *arg0, s32 *arg1) {
	*arg0 = D_800E65C8->unk4 + D_800E65CC;
	*arg1 = D_800E65C8->unk8;
}

f32 func_8007042C_1584EC(void) {
	return D_800E65E0 / D_800E65C8->unk10;
}

f32 func_80070448_158508(void) {
	return D_800E65E0 / D_800E65C8->unk14;
}

#ifdef NON_MATCHING
/* CURRENT(1715) */
void func_80070464_158524(s32 *arg0, s32 *arg1, s32 arg2) {
	s32 temp_v1;

void func_80073A48_15BB08(void) {
}

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_80073A50_15BB10.s")

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_8007453C_15C5FC.s")

void func_80074998_15CA58(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = D_800E6460 - 1;
	if (var_s1 >= 0) {
		do {
			var_s0 = D_800E6464 - 1;
			if (var_s0 >= 0) {
				do {
					func_8007453C_15C5FC(var_s1, var_s0);
					var_s0 -= 1;
				} while (var_s0 >= 0);
			}
			var_s1 -= 1;
		} while (var_s1 >= 0);
	}
}

void func_80074A0C_15CACC(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = D_800E6460 - 1;
	if (var_s1 >= 0) {
		do {
			if (D_800E6464 > 0) {
				var_s0 = 0;
				do {
					func_8007453C_15C5FC(var_s1, var_s0);
					var_s0 += 1;
				} while (var_s0 < D_800E6464);
			}
			var_s1 -= 1;
		} while (var_s1 >= 0);
	}
}

void func_80074A8C_15CB4C(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = 0;
	if (var_s1 < D_800E6460) {
		do {
			var_s0 = D_800E6464 - 1;
			if (var_s0 >= 0) {
				do {
					func_8007453C_15C5FC(var_s1, var_s0);
					var_s0 -= 1;
				} while (var_s0 >= 0);
			}
			var_s1 += 1;
		} while (var_s1 < D_800E6460);
	}
}

void func_80074B0C_15CBCC(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = 0;
	if (var_s1 < D_800E6460) {
		do {
			if (D_800E6464 > 0) {
				var_s0 = 0;
				do {
					func_8007453C_15C5FC(var_s1, var_s0);
					var_s0 += 1;
				} while (var_s0 < D_800E6464);
			}
			var_s1 += 1;
		} while (var_s1 < D_800E6460);
	}
}

void func_80074B98_15CC58(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = D_800E6464 - 1;
	if (var_s1 >= 0) {
		do {
			if (D_800E6460 > 0) {
				var_s0 = 0;
				do {
					func_8007453C_15C5FC(var_s0, var_s1);
					var_s0 += 1;
				} while (var_s0 < D_800E6460);
			}
			var_s1 -= 1;
		} while (var_s1 >= 0);
	}
}

void func_80074C18_15CCD8(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = D_800E6464 - 1;
	if (var_s1 >= 0) {
		do {
			var_s0 = D_800E6460 - 1;
			if (var_s0 >= 0) {
				do {
					func_8007453C_15C5FC(var_s0, var_s1);
					var_s0 -= 1;
				} while (var_s0 >= 0);
			}
			var_s1 -= 1;
		} while (var_s1 >= 0);
	}
}

void func_80074C8C_15CD4C(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = 0;
	if (var_s1 < D_800E6464) {
		do {
			if (D_800E6460 > 0) {
				var_s0 = 0;
				do {
					func_8007453C_15C5FC(var_s0, var_s1);
					var_s0 += 1;
				} while (var_s0 < D_800E6460);
			}
			var_s1 += 1;
		} while (var_s1 < D_800E6464);
	}
}

void func_80074D18_15CDD8(void) {
	s32 var_s0;
	s32 var_s1;

	var_s1 = 0;
	if (var_s1 < D_800E6464) {
		do {
			var_s0 = D_800E6460 - 1;
			if (var_s0 >= 0) {
				do {
					func_8007453C_15C5FC(var_s0, var_s1);
					var_s0 -= 1;
				} while (var_s0 >= 0);
			}
			var_s1 += 1;
		} while (var_s1 < D_800E6464);
	}
}

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_80074D98_15CE58.s")

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_80074FF0_15D0B0.s")

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/inside/158330/func_8007568C_15D74C.s")

typedef struct {
	/* 0x00 */ u8 pad0[0x8];
	/* 0x08 */ s16 unk8;
	/* 0x0A */ s16 unkA;
	/* 0x0C */ s16 unkC;
	/* 0x0E */ s16 unkE;
	/* 0x10 */ s16 unk10;
	/* 0x12 */ s16 unk12;
	/* 0x14 */ u8 pad14[0x34];
} Unk80076538Obj; /* size = 0x48 */

void func_80076538_15E5F8(s32 arg0) {
	Unk800E66A8 *temp_v0;
	Unk80076538Obj *temp_v0_2;
	Unk80076538Obj *temp_v0_3;
	Unk80076538Obj *temp_v0_4;
	Unk80076538Obj *temp_v0_5;
	s32 var_t0;
	s32 var_v1;
	u8 temp_a2;

	temp_v0 = &D_800E66A8[arg0];
	temp_a2 = temp_v0->unk0;
	var_v1 = temp_v0->unk2;
	var_t0 = temp_v0->unk6;

	switch (temp_v0->unk8) {
		case 0:
			temp_v0_2 = &((Unk80076538Obj *) D_800E65BC)[temp_a2];
			var_v1 += temp_v0_2->unk8;
			var_t0 += temp_v0_2->unkA;
			break;

		case 1:
			temp_v0_3 = &((Unk80076538Obj *) D_800E65BC)[temp_a2];
			var_v1 += temp_v0_3->unkA;
			var_t0 -= temp_v0_3->unk8;
			break;

		case 2:
			temp_v0_4 = &((Unk80076538Obj *) D_800E65BC)[temp_a2];
			var_v1 -= temp_v0_4->unk8;
			var_t0 -= temp_v0_4->unkA;
			break;

		case 3:
			temp_v0_5 = &((Unk80076538Obj *) D_800E65BC)[temp_a2];
			var_v1 -= temp_v0_5->unkA;
			var_t0 += temp_v0_5->unk8;
			break;
	}

