#include <ultra64.h>
#include "common.h"

u8 D_8013E450_14D400[0x0C] = {
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFF,
};

u8 D_8013E45C_14D40C[4] = {
	0xFF, 0xFF, 0xFF, 0xFF,
};

u8 D_8013E460_14D410[4] = {
	0xFF, 0xFF, 0xFF, 0xFF,
};

u8 D_8013E464_14D414[0x0C] = {
	0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x01, 0x00, 0x00, 0x40, 0x00, 0x00, 0x00,
};

u8 D_8013E470_14D420[4] = {
	0x01, 0x00, 0x1B, 0x50,
};

u8 D_8013E474_14D424[4] = {
	0x00, 0x00, 0x00, 0x00,
};

u8 D_8013E478_14D428[0x18] = {
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3D, 0x00, 0x00, 0x00, 0x3F, 0x00, 0x00, 0x00, 0x3C,
	0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,
};

u8 D_8013E490_14D440[0x10C] = {
	0x01, 0x00, 0x49, 0xF0, 0xFF, 0xFF, 0x00, 0x37, 0x00, 0x26, 0x28, 0xA0, 0x00, 0x00, 0x00, 0x46,
	0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00, 0x45, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x01, 0x00, 0x4D, 0xB0, 0xFF, 0xF4, 0x00, 0x3F, 0x00, 0x26, 0x28, 0xA0, 0x00, 0x00, 0x00, 0x4B,
	0x00, 0x00, 0x00, 0x4C, 0x00, 0x00, 0x00, 0x4A, 0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,
	0x01, 0x00, 0x4D, 0xB0, 0xFF, 0xFA, 0x00, 0x3A, 0x00, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x43,
	0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00, 0x42, 0xFF, 0xFF, 0x00, 0x00, 0xBF, 0x80, 0x00, 0x00,
	0x01, 0x00, 0x54, 0xE0, 0xFF, 0xF9, 0x00, 0x2A, 0x00, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x4E,
	0x00, 0x00, 0x00, 0x50, 0x00, 0x00, 0x00, 0x4D, 0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,

// CURRENT(2310)
#ifdef NON_MATCHING
void func_800EA8F8_F98A8(VehicleInstance *arg0, s16 arg1, s16 arg2) {
	s32 abs_diff;
	s32 v1;
	s32 level;
	s32 step;
	s32 offset;
	s32 entry_flags;
	s32 entry_val;
	s32 neg_step;

	D_8015757C = 0;

	// Load current angle and calculate difference
	v1 = (s16)(arg0->unkE - arg1);

	// Calculate absolute value
	if (v1 >= 0) {
		abs_diff = v1;
	} else {
		abs_diff = -v1;
	}

	// Check if difference is too large
	if (abs_diff >= 0xA001) {
		D_8015757C = 1;
		v1 = (s16)(arg0->unkE - arg1);
	}

	// First condition: v1 < -0x4000
	if (v1 < -0x4000) {
		level = D_80157A0C;
		if (level != 0xE) {
			if (!(D_80157A28 & 4)) {
				// Calculate offset into state array
			offset = level * 0x34;

			// Access state entry
			entry_flags = *((s32 *)((char *)&D_8013E5AC_14D55C + offset + 4));

			// Modify state at 0x2DC
			if (entry_flags & 0x20) {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x2DC)) |= 0x20;
			} else {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x2DC)) &= ~0x20;
			}

			// Modify state at 0x2E0
			if (!(entry_flags & 0x100)) {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x2E0)) = level;
			} else {
				entry_val = *((s32 *)((char *)&D_8013E5AC_14D55C + offset + 8));
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x2E0)) = entry_val;
			}

			func_800EB534_FA4E4(&D_80157600, 0xE, 0, 0);

			// Calculate step
			step = (s16)(arg1 - arg0->unkE) / 7;
			D_801575D4 = step;
				v1 = (s16)(arg0->unkE - arg1);
				goto clamp_angle;
			}
		}
	}

	if (v1 >= 0x4001) {
		// Second condition: v1 >= 0x4001
		level = D_80157A0C;
		if (level != 0xF) {
			if (!(D_80157A28 & 4)) {
				// Calculate offset into state array
			offset = level * 0x34;

			// Access state entry
			entry_flags = *((s32 *)((char *)&D_8013E5AC_14D55C + offset + 4));

			// Modify state at 0x310
			if (entry_flags & 0x20) {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x310)) |= 0x20;
			} else {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x310)) &= ~0x20;
			}

			// Modify state at 0x314
			if (!(entry_flags & 0x100)) {
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x314)) = level;
			} else {
				entry_val = *((s32 *)((char *)&D_8013E5AC_14D55C + offset + 8));
				*((s32 *)((char *)&D_8013E5AC_14D55C + 0x314)) = entry_val;
			}

			func_800EB534_FA4E4(&D_80157600, 0xF, 0, 0);

			// Calculate step
			step = (s16)(arg0->unkE - arg1) / 7;
			D_801575D4 = step;
				v1 = (s16)(arg0->unkE - arg1);
				goto clamp_angle;
			}
		}
	}

	// Default case
	level = D_80157A0C;
	offset = level * 0x34;

	entry_flags = *((s32 *)((char *)&D_8013E5AC_14D55C + offset + 4));

	if (!(entry_flags & 0x100)) {
		D_801575D4 = 0x5DC;
		v1 = (s16)(arg0->unkE - arg1);
	}

clamp_angle:
	// Clamp angle
	step = D_801575D4;
	neg_step = -step;

	if (v1 < neg_step) {
		arg0->unkE = arg0->unkE + step;
	} else if (step < v1) {
		arg0->unkE = arg0->unkE - step;
	} else {
		arg0->unkE = arg1;
	}
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/outside/F9230/func_800EA8F8_F98A8.s")
#endif

typedef struct {
	/* 0x00 */ u8 pad0[0x18];
	/* 0x18 */ s16 unk18;
	/* 0x1A */ s16 unk1A;
	/* 0x1C */ s16 unk1C;
	/* 0x1E */ s16 unk1E;
} UnkF9230AnimEntry; /* size = 0x20 */

typedef struct {
	/* 0x00 */ u8 pad0[0x20];
	/* 0x20 */ s16 unk20;
	/* 0x22 */ s16 unk22;
	/* 0x24 */ s16 unk24;
} UnkF9230SpecView;

// CURRENT(5156)
#ifdef NON_MATCHING
void func_800EABE0_F9B90(VehicleInstance *arg0) {
	Vec3f sp2C;
	u16 sp2A;
	s32 temp;
	s16 temp_v0;
	UnkF9230SpecView *spec;
	f32 temp_f2;

	temp = D_80159020->unk0;
	if (temp < 0) {
		temp += 3;
	}
	sp2C.x = (f32)(temp >> 2);

	temp = D_80159020->unk2;
	if (temp < 0) {
		temp += 3;
	}
	sp2C.y = (f32)(temp >> 2);

	temp = D_80159020->unk4;
	if (temp < 0) {
		temp += 3;
	}
	sp2C.z = (f32)(temp >> 2);

	temp_f2 = func_800EA604_F95B4((s16 *)arg0, &sp2C);
	temp_v0 = *(s16 *)((u8 *)D_8013E45C_14D40C + (D_801575DC << 5) + 0x1E);
	sp2A = (u16)(s16)(s32)(((f32)temp_v0 * (1.0f - temp_f2)) + ((f32)-temp_v0 * temp_f2));

	spec = func_800FAFB8_109F68(arg0);
	spec->unk20 = *(s16 *)((u8 *)D_8013E45C_14D40C + (D_801575DC << 5) + 0x18);
