#include <ultra64.h>
#include "common.h"

u8 D_8013E450_14D400[0x0C] = {
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xFF,
};

u8 D_8013E45C_14D40C[4] = {
	0xFF, 0xFF, 0xFF, 0xFF,
};

u8 D_8013E460_14D410[4] = {
	0xFF, 0xFF, 0xFF, 0xFF,
};

u8 D_8013E464_14D414[0x0C] = {
	0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x01, 0x00, 0x00, 0x40, 0x00, 0x00, 0x00,
};

u8 D_8013E470_14D420[4] = {
	0x01, 0x00, 0x1B, 0x50,
};

u8 D_8013E474_14D424[4] = {
	0x00, 0x00, 0x00, 0x00,
};

u8 D_8013E478_14D428[0x18] = {
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3D, 0x00, 0x00, 0x00, 0x3F, 0x00, 0x00, 0x00, 0x3C,
	0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,
};

u8 D_8013E490_14D440[0x10C] = {
	0x01, 0x00, 0x49, 0xF0, 0xFF, 0xFF, 0x00, 0x37, 0x00, 0x26, 0x28, 0xA0, 0x00, 0x00, 0x00, 0x46,
	0x00, 0x00, 0x00, 0x48, 0x00, 0x00, 0x00, 0x45, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
	0x01, 0x00, 0x4D, 0xB0, 0xFF, 0xF4, 0x00, 0x3F, 0x00, 0x26, 0x28, 0xA0, 0x00, 0x00, 0x00, 0x4B,
	0x00, 0x00, 0x00, 0x4C, 0x00, 0x00, 0x00, 0x4A, 0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,
	0x01, 0x00, 0x4D, 0xB0, 0xFF, 0xFA, 0x00, 0x3A, 0x00, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x43,
	0x00, 0x00, 0x00, 0x44, 0x00, 0x00, 0x00, 0x42, 0xFF, 0xFF, 0x00, 0x00, 0xBF, 0x80, 0x00, 0x00,
	0x01, 0x00, 0x54, 0xE0, 0xFF, 0xF9, 0x00, 0x2A, 0x00, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x4E,
	0x00, 0x00, 0x00, 0x50, 0x00, 0x00, 0x00, 0x4D, 0x00, 0x01, 0x00, 0x00, 0x3F, 0x80, 0x00, 0x00,

	D_80157A48.unk410 = 1.0f;
	func_8000C790_D390(&D_80157A48, &D_8003BAE0, 0x10);
	D_80157E70 = 0;
	D_80157A48.unk8 = temp_zero;
	D_80157A48.unk10 = temp_zero;
	D_80157A48.unk40C = 0x27;
	D_80157A48.unkC = 145.0f;
	func_800EB534_FA4E4(&D_80157A48, 0x23, 7, 0);
	D_801575E0.unk0 = 0;
	D_801575E0.unk2 = 0;
	D_801575E0.unk4 = 0;
	D_801575E0.unk6 = 0;
	D_801575E0.unk8 = 0;
	D_801575E0.unkA = 0;
	D_801575E0.unkC = 0;
	D_801575E0.unkE = 0;
	D_801575E0.unk10 = 0;
	D_801575E0.unk12 = 0;
	D_801575E0.unk14 = 0;
	D_801575E0.unk16 = 0;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/outside/F9230/func_800EA434_F93E4.s")
#endif

void func_800EA5B8_F9568(void) {
	func_8000C764_D364(D_80157A04);
	func_8000C764_D364(D_80157A08);
	func_8000C764_D364(D_80157E4C);
	func_8000C764_D364(D_80157E50);
	D_80048188 = 0;
}

// CURRENT(4121)
#ifdef NON_MATCHING
f32 func_800EA604_F95B4(s16 *arg0, Vec3f *arg1) {
	f32 diffX;
	f32 diffY;
	f32 diffZ;
	f32 result;
	f32 absDiffY;
	s32 xPart;
	s32 yPart;
	s32 zPart;
	s32 angle;

	extern f64 D_801443D0_153380;
	extern f64 D_801443D8_153388;

	if (arg0[0] < 0) {
		xPart = (arg0[0] + 3) >> 2;
	} else {
		xPart = arg0[0] >> 2;
	}
	diffX = arg1->x - xPart;

	if (arg0[1] < 0) {
		yPart = (arg0[1] + 3) >> 2;
	} else {
		yPart = arg0[1] >> 2;
	}
	diffY = arg1->y - (yPart + 0xE);

	if (arg0[2] < 0) {
		zPart = (arg0[2] + 3) >> 2;
	} else {
		zPart = arg0[2] >> 2;
	}
	diffZ = arg1->z - zPart;
	angle = func_80003824_4424(sqrtf((diffX * diffX) + (diffZ * diffZ)), (diffY >= 0.0f) ? diffY : -diffY);

	if (diffY < 0.0f) {
		result = (f32)((((f64)(f32) (angle & 0xFFFF) * D_801443D0_153380) / 32768.0 / 40.0 * 0.5) + 0.5);
	} else {
		result = (f32)(0.5 - ((((f64)(f32) (angle & 0xFFFF) * D_801443D8_153388) / 32768.0 / 40.0) * 0.5));
	}

	if (result < 0.0f) {
		result = 0.0f;
	}
	if (result > 1.0f) {
		result = 1.0f;
	}

	return result;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/outside/F9230/func_800EA604_F95B4.s")
#endif

#ifdef NON_MATCHING
s32 func_800EA7DC_F978C(s16 arg0, Vec3f *arg1, Vec3f *arg2, s32 arg3, f32 arg4) {
	s32 temp_v1;
	s32 var_a0;
	s32 var_v0;
	s32 var_v0_2;

	temp_v1 = (arg3 & 0xFFFF) - (func_80003824_4424(arg1->z - arg2->z, arg1->x - arg2->x) & 0xFFFF);
	var_a0 = temp_v1;
	if (temp_v1 >= 0) {
		var_v0 = temp_v1;
	} else {
		var_v0 = -temp_v1;
	}
	if (var_v0 >= 0x8001) {
		u32 var_at = 0x10000;
		if (temp_v1 > 0) {
			var_at = 0xFFFF0000;
		}
		var_a0 = temp_v1 + var_at;
	}
	if (var_a0 >= 0) {
		var_v0_2 = var_a0;
	} else {
		var_v0_2 = -var_a0;
	}
	if (var_v0_2 < (s16) (s32) ((f64) ((arg4 / 2) * 32768.0f) / D_801443E0_153390)) {
		goto block_18;
	}
	if (var_a0 >= 0) {
		if (arg0 >= -4) {
			return 2;
		}
		goto block_18;
	}
	if ((var_a0 < 0) && (arg0 < 5)) {
		return 1;
	}
block_18:
	return 0;
}
#else
#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/outside/F9230/func_800EA7DC_F978C.s")
#endif

#pragma GLOBAL_ASM("asm/nonmatchings/overlay_gameplay/outside/F9230/func_800EA8F8_F98A8.s")

typedef struct {
	/* 0x00 */ u8 pad0[0x18];
	/* 0x18 */ s16 unk18;
	/* 0x1A */ s16 unk1A;
	/* 0x1C */ s16 unk1C;
	/* 0x1E */ s16 unk1E;
} UnkF9230AnimEntry; /* size = 0x20 */

typedef struct {
	/* 0x00 */ u8 pad0[0x20];
	/* 0x20 */ s16 unk20;
	/* 0x22 */ s16 unk22;
	/* 0x24 */ s16 unk24;
} UnkF9230SpecView;

// CURRENT(9473)
#ifdef NON_MATCHING
void func_800EABE0_F9B90(VehicleInstance *arg0) {
	Vec3f sp2C;
	u16 sp2A;
	s16 temp_v0;
	UnkF9230SpecView *spec;
	f64 temp_f2;
	u16 temp_a0;

	sp2C.x = (f32)((D_80159020->unk0 >= 0) ? (D_80159020->unk0 >> 2) : ((D_80159020->unk0 + 3) >> 2));
	sp2C.y = (f32)((D_80159020->unk2 >= 0) ? (D_80159020->unk2 >> 2) : ((D_80159020->unk2 + 3) >> 2));
	sp2C.z = (f32)((D_80159020->unk4 >= 0) ? (D_80159020->unk4 >> 2) : ((D_80159020->unk4 + 3) >> 2));

	temp_f2 = func_800EA604_F95B4((s16 *)arg0, &sp2C);
	temp_v0 = ((UnkF9230AnimEntry *)D_8013E45C_14D40C)[D_801575DC].unk1E;
	sp2A = (u16)(s16)(s32)(((f32)temp_v0 * (1.0f - temp_f2)) + ((f32)-temp_v0 * temp_f2));

	spec = func_800FAFB8_109F68(arg0);
	spec->unk20 = ((UnkF9230AnimEntry *)D_8013E45C_14D40C)[D_801575DC].unk18;
	temp_a0 = sp2A;
